OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1776.h
extern __at(0x0811) __sfr COG3DBR;

typedef union
  {
  struct
    {
    unsigned DBR0               : 1;
    unsigned DBR1               : 1;
    unsigned DBR2               : 1;
    unsigned DBR3               : 1;
    unsigned DBR4               : 1;
    unsigned DBR5               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned G3DBR0             : 1;
    unsigned G3DBR1             : 1;
    unsigned G3DBR2             : 1;
    unsigned G3DBR3             : 1;
    unsigned G3DBR4             : 1;
    unsigned G3DBR5             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned G3DBR              : 6;
    unsigned                    : 2;
    };

  struct
    {
    unsigned DBR                : 6;
    unsigned                    : 2;
    };
  } __COG3DBRbits_t;

extern __at(0x0811) volatile __COG3DBRbits_t COG3DBRbits;

#define _COG3DBR_DBR0           0x01
#define _COG3DBR_G3DBR0         0x01
#define _COG3DBR_DBR1           0x02
#define _COG3DBR_G3DBR1         0x02
#define _COG3DBR_DBR2           0x04
#define _COG3DBR_G3DBR2         0x04
#define _COG3DBR_DBR3           0x08
#define _COG3DBR_G3DBR3         0x08
#define _COG3DBR_DBR4           0x10
#define _COG3DBR_G3DBR4         0x10
#define _COG3DBR_DBR5           0x20
#define _COG3DBR_G3DBR5         0x20

//==============================================================================


//==============================================================================
//        COG3DBF Bits

extern __at(0x0812) __sfr COG3DBF;

typedef union
  {
  struct
    {
    unsigned DBF0               : 1;
    unsigned DBF1               : 1;
    unsigned DBF2               : 1;
    unsigned DBF3               : 1;
    unsigned DBF4               : 1;
    unsigned DBF5               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned G3DBF0             : 1;
    unsigned G3DBF1             : 1;
    unsigned G3DBF2             : 1;
    unsigned G3DBF3             : 1;
    unsigned G3DBF4             : 1;
    unsigned G3DBF5             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned DBF                : 6;
    unsigned                    : 2;
    };

  struct
    {
    unsigned G3DBF              : 6;
    unsigned                    : 2;
    };
  } __COG3DBFbits_t;

extern __at(0x0812) volatile __COG3DBFbits_t COG3DBFbits;

#define _COG3DBF_DBF0           0x01
#define _COG3DBF_G3DBF0         0x01
#define _COG3DBF_DBF1           0x02
#define _COG3DBF_G3DBF1         0x02
#define _COG3DBF_DBF2           0x04
#define _COG3DBF_G3DBF2         0x04
#define _COG3DBF_DBF3           0x08
#define _COG3DBF_G3DBF3         0x08
#define _COG3DBF_DBF4           0x10
#define _COG3DBF_G3DBF4         0x10
#define _COG3DBF_DBF5           0x20
#define _COG3DBF_G3DBF5         0x20

//==============================================================================


//==============================================================================
//        COG3CON0 Bits

extern __at(0x0813) __sfr COG3CON0;

typedef union
  {
  struct
    {
    unsigned MD0                : 1;
    unsigned MD1                : 1;
    unsigned MD2                : 1;
    unsigned CS0                : 1;
    unsigned CS1                : 1;
    unsigned                    : 1;
    unsigned LD                 : 1;
    unsigned EN                 : 1;
    };

  struct
    {
    unsigned G3MD0              : 1;
    unsigned G3MD1              : 1;
    unsigned G3MD2              : 1;
    unsigned G3CS0              : 1;
    unsigned G3CS1              : 1;
    unsigned                    : 1;
    unsigned G3LD               : 1;
    unsigned G3EN               : 1;
    };

  struct
    {
    unsigned MD                 : 3;
    unsigned                    : 5;
    };

  struct
    {
    unsigned G3MD               : 3;
    unsigned                    : 5;
    };

  struct
    {
    unsigned                    : 3;
    unsigned CS                 : 2;
    unsigned                    : 3;
    };

  struct
    {
    unsigned                    : 3;
    unsigned G3CS               : 2;
    unsigned                    : 3;
    };
  } __COG3CON0bits_t;

extern __at(0x0813) volatile __COG3CON0bits_t COG3CON0bits;

#define _COG3CON0_MD0           0x01
#define _COG3CON0_G3MD0         0x01
#define _COG3CON0_MD1           0x02
#define _COG3CON0_G3MD1         0x02
#define _COG3CON0_MD2           0x04
#define _COG3CON0_G3MD2         0x04
#define _COG3CON0_CS0           0x08
#define _COG3CON0_G3CS0         0x08
#define _COG3CON0_CS1           0x10
#define _COG3CON0_G3CS1         0x10
#define _COG3CON0_LD            0x40
#define _COG3CON0_G3LD          0x40
#define _COG3CON0_EN            0x80
#define _COG3CON0_G3EN          0x80

//==============================================================================


//==============================================================================
//        COG3CON1 Bits

extern __at(0x0814) __sfr COG3CON1;

typedef union
  {
  struct
    {
    unsigned POLA               : 1;
    unsigned POLB               : 1;
    unsigned POLC               : 1;
    unsigned POLD               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned FDBS               : 1;
    unsigned RDBS               : 1;
    };

  struct
    {
    unsigned G3POLA             : 1;
    unsigned G3POLB             : 1;
    unsigned G3POLC             : 1;
    unsigned G3POLD             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned G3FDBS             : 1;
    unsigned G3RDBS             : 1;
    };
  } __COG3CON1bits_t;

extern __at(0x0814) volatile __COG3CON1bits_t COG3CON1bits;

#define _COG3CON1_POLA          0x01
#define _COG3CON1_G3POLA        0x01
#define _COG3CON1_POLB          0x02
#define _COG3CON1_G3POLB        0x02
#define _COG3CON1_POLC          0x04
#define _COG3CON1_G3POLC        0x04
#define _COG3CON1_POLD          0x08
#define _COG3CON1_G3POLD        0x08
#define _COG3CON1_FDBS          0x40
#define _COG3CON1_G3FDBS        0x40
#define _COG3CON1_RDBS          0x80
#define _COG3CON1_G3RDBS        0x80

//==============================================================================


//==============================================================================
//        COG3RIS0 Bits

extern __at(0x0815) __sfr COG3RIS0;

typedef union
  {
  struct
    {
    unsigned RIS0               : 1;
    unsigned RIS1               : 1;
    unsigned RIS2               : 1;
    unsigned RIS3               : 1;
    unsigned RIS4               : 1;
    unsigned RIS5               : 1;
    unsigned RIS6               : 1;
    unsigned RIS7               : 1;
    };

  struct
    {
    unsigned G3RIS0             : 1;
    unsigned G3RIS1             : 1;
    unsigned G3RIS2             : 1;
    unsigned G3RIS3             : 1;
    unsigned G3RIS4             : 1;
    unsigned G3RIS5             : 1;
    unsigned G3RIS6             : 1;
    unsigned G3RIS7             : 1;
    };
  } __COG3RIS0bits_t;

extern __at(0x0815) volatile __COG3RIS0bits_t COG3RIS0bits;

#define _COG3RIS0_RIS0          0x01
#define _COG3RIS0_G3RIS0        0x01
#define _COG3RIS0_RIS1          0x02
#define _COG3RIS0_G3RIS1        0x02
#define _COG3RIS0_RIS2          0x04
#define _COG3RIS0_G3RIS2        0x04
#define _COG3RIS0_RIS3          0x08
#define _COG3RIS0_G3RIS3        0x08
#define _COG3RIS0_RIS4          0x10
#define _COG3RIS0_G3RIS4        0x10
#define _COG3RIS0_RIS5          0x20
#define _COG3RIS0_G3RIS5        0x20
#define _COG3RIS0_RIS6          0x40
#define _COG3RIS0_G3RIS6        0x40
#define _COG3RIS0_RIS7          0x80
#define _COG3RIS0_G3RIS7        0x80

//==============================================================================


//==============================================================================
//        COG3RIS1 Bits

extern __at(0x0816) __sfr COG3RIS1;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned RIS9               : 1;
    unsigned                    : 1;
    unsigned RIS11              : 1;
    unsigned RIS12              : 1;
    unsigned RIS13              : 1;
    unsigned RIS14              : 1;
    unsigned RIS15              : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned G3RIS9             : 1;
    unsigned                    : 1;
    unsigned G3RIS11            : 1;
    unsigned G3RIS12            : 1;
    unsigned G3RIS13            : 1;
    unsigned G3RIS14            : 1;
    unsigned G3RIS15            : 1;
    };
  } __COG3RIS1bits_t;

extern __at(0x0816) volatile __COG3RIS1bits_t COG3RIS1bits;

#define _COG3RIS1_RIS9          0x02
#define _COG3RIS1_G3RIS9        0x02
#define _COG3RIS1_RIS11         0x08
#define _COG3RIS1_G3RIS11       0x08
#define _COG3RIS1_RIS12         0x10
#define _COG3RIS1_G3RIS12       0x10
#define _COG3RIS1_RIS13         0x20
#define _COG3RIS1_G3RIS13       0x20
#define _COG3RIS1_RIS14         0x40
#define _COG3RIS1_G3RIS14       0x40
#define _COG3RIS1_RIS15         0x80
#define _COG3RIS1_G3RIS15       0x80

//==============================================================================


//==============================================================================
//        COG3RSIM0 Bits

extern __at(0x0817) __sfr COG3RSIM0;

typedef union
  {
  struct
    {
    unsigned RSIM0              : 1;
    unsigned RSIM1              : 1;
    unsigned RSIM2              : 1;
    unsigned RSIM3              : 1;
    unsigned RSIM4              : 1;
    unsigned RSIM5              : 1;
    unsigned RSIM6              : 1;
    unsigned RSIM7              : 1;
    };

  struct
    {
    unsigned G3RSIM0            : 1;
    unsigned G3RSIM1            : 1;
    unsigned G3RSIM2            : 1;
    unsigned G3RSIM3            : 1;
    unsigned G3RSIM4            : 1;
    unsigned G3RSIM5            : 1;
    unsigned G3RSIM6            : 1;
    unsigned G3RSIM7            : 1;
    };
  } __COG3RSIM0bits_t;

